from aiogram import types, Dispatcher
from create_bot import dp, bot
from keyboards import kb_client_ok, kb_client_sos, kb_client_dal, kb_con_sam, kb_self_help, kb_client_emoc, kb_client_strah, kb_client_grust, kb_client_zlo, kb_client_ap
from keyboards import kb_client_misly, kb_client_cituacy, kb_client_what_to_do, kb_chto_z_back, kb_stress, kb_kr_stress, cht_kr_zap
from aiogram.types import ReplyKeyboardRemove
from aiogram.dispatcher.filters import Text

# @dp.message_handler(commands=['start', 'help'])
async def commands_start(message : types.Message):
    await message.answer("Здравствуй! Я - бот. Я задам несколько вопросов.", reply_markup=kb_client_ok)


# @dp.message_handler(commands=['Ok'])
async def otv_ok(message : types.Message):
    await message.answer("Определи своё психоэмоциональное состояние. Выбери цифру, где 1 - неприятно, но терпимо. 10 - невыносимо.", reply_markup=kb_client_sos)


# @dp.message_handler(commands=['1_3'])
async def otv_one_three(message : types.Message):
    await message.reply("Вроде бы не всё так плохо? Ты можешь договориться с психологом о встрече в любой день с понедельника по пятницу, предварительно записавшись (ниже). Это конфидециально. Но в любом случае обрати внимание на свой режим труда/отдыха. Что ты можешь сделать для того, чтобы день был менее напряжённым? Исключи любые психоактивные вещества. Обязательно высыпайся! Отследи, что или кто добавляет дополнительный стресс? Подумай, что предаёт тебе сил? Запиши это в свои заметки. Забота о себе сейчас в приоритете.", reply_markup=kb_client_dal)


# @dp.message_handler(commands=['4_6'])
async def otv_four_six(message : types.Message):
    await message.reply("Ок, давай поступим так: ты можешь договориться с психологом о встрече в любой день с понедельника по пятницу, предварительно записавшись. Это конфидециально. Чтобы ситуация не вышла из под контроля постарайся пока не принимать важных решений, если есть возможность дать себе время, поразмышляй о том, что сейчас в наиболее важно и по какой причине? Записывай свои мысли. Старайся позаботиться о своём режиме труда/отдыха, потому что это очень важно для психики. Для записи к психологу, жми.", reply_markup=kb_client_dal)


# @dp.message_handler(commands=['7_10'])
async def otv_seven_ten(message : types.Message):
    await message.reply("Чтобы снять приступ сильной тревоги, сделай несколько глубоких вдохов с задержками, если можешь, выйди на свежий воздух. Дай себе время. В кризис самое главное остановиться и дать психике возможность поработать в 'default режиме' для самовосстановления. Перезагрузиться. В трудный период необходимо почувствовать опору. Вспомни, что тебе предаёт сил? Звонок близкому? Беседа с другом? Выписывание мыслей? Физическая активность? Музыка? Любые средства хороши для сохраниения себя в кризис. Если произошло психотравмирующее событие, с ним нужно работать. Чтобы получить профессиональную помощь запишись к психологу в любой день с понедельника по пятницу. Это конфидециально и безопасно.  Нажми для записи.", reply_markup=kb_client_dal)


# @dp.message_handler(commands=['Далее'])
async def dal_further(message : types.Message):
    await message.answer("Выбери пожалуйста, что тебе сейчас больше подходит?", reply_markup=kb_con_sam)


# @dp.message_handler(commands=['Личная_консультация'])
async def link_expert(message : types.Message):
    await message.answer("Напишите мне:\nhttps://t.me/psychology_ncfu", reply_markup=ReplyKeyboardRemove())


# @dp.message_handler(commands=['Самопомощь'])
async def self_help(message : types.Message):
    await message.answer("Что вам подходит?", reply_markup=kb_self_help)

'''*****************************************************************************************'''
# РАСЗДЕЛ РАБОТА С ЭМОЦИЯМИ/эмоции
# @dp.message_handler(commands=['РАБОТА_С_ЭМОЦИЯМИ'])
async def work_with_emotions(message : types.Message):
    await message.answer("Эмоции - это реакция психики и тела на стимул. Если ты не отреагируешь, то напряжение будет расти и может проявиться в другом качестве или даже повлечь за собой соматические проявления. Напряжение можно снимать физической нагрузкой и упражнениями, которые соответствуют зоне напряжения. Выбери основную негативную эмоцию. Отследи, при каких обстоятельствах она проявляется ярче всего. Возможно само только осознание уже поможет реагировать более конструктивно. Но часто истинная причина не на поверхности, а в подсознании. Тут не обойтись без погружения в себя.", reply_markup=kb_client_emoc)


# страх
# @dp.message_handler(commands=['cтрах'])
async def strah(message : types.Message):
    await message.answer("Эмоция страха отнимает много сил. Из-за страха человек раздражен, насторожен, агрессивен. Тревога, это тоже разновидность страха. Тревога может переходить в панические атаки, что серьёзно портит человеку жизнь, по этому старайся не раскручивать тревогу. Избавляйся от напряжения через физ нагрузку, дыхательные техники, крик (можно выехать за город). Если состояние страха сохраняется, нужно искать первопричину. Возможно со специалистом, поскольку многие процессы проходят в психике бессознательно и самостоятельно увидеть их невозможно.", reply_markup=kb_client_strah)


# грусть
# @dp.message_handler(commands=['грусть'])
async def grust(message : types.Message):
    await message.answer("Эмоция грусти подразумевает бессилие, неудовлетворенность и пассивное поведение. Как и любую другую эмоцию, грусть нужно отреагировать. Не уходи от этого состояния, а иди в него. Грусти. Плачь. Горюй. Опиши её. Почувствуй, где она в теле. Побудь с ней. Задай себе вопрос: что я могу для себя сделать? Каким образом? Помни, что музыка очень влияет на психо-эмоциональное состояние человека, по этому соответственно формируй свой плей-лист. Бывает грусть переходит в активную фазу, а затем в гнев. Будь к этому готов.", reply_markup=kb_client_grust)


# злость
# @dp.message_handler(commands=['злость'])
async def zlo(message : types.Message):
    await message.answer("Злость - естественная реакция, когда не удовлетворена потребность. Причем она может быть как топливом для достижения целей. Но так же она может 'затмевать' разум переходить в ярость. Мышление сужается, становится ограниченным. Так же как и при страхе и при тревоге - необходимо приводить в активность голос и конечности. Уединись, встань и встряхнись всем телом несколько раз. Оскалься и порычи. Поработай кулаками. Попрыгай. Подыши глубоко. Если есть возможность пробежки на свежем в воздухе - прекрасно.", reply_markup=kb_client_zlo)


# апатия
# @dp.message_handler(commands=['апатия'])
async def apat(message : types.Message):
    await message.answer("Безразличие и бессилие. Переутомление приводит к нехватке психической энергии, такое состояние называют 'эмоциональное выгорание'. Пропадает интерес к учебе, времяпрепровождению с друзьями и к удовольствиям. По этому очень важен режим учёбы/отдыха. Первым делом необходимо обеспечить себе достаточный сон, сбаласированный рацион питания для мозга и свежий воздух. И очень важно понимать, если подавлено настроение, потерян интерес к жизни, нарушен сон и аппетит и это состояние продолжительно, это возможно серьёзное органическое заболевание - депрессия. Депрессия - заболевание, при котором необходим врач!", reply_markup=kb_client_ap)
'''*****************************************************************************************'''


#Раздел работа с мыслями
# @dp.message_handler(commands=['РАБОТА_С_МЫСЛЯМИ'])
async def work_misly(message : types.Message):
    await message.answer("Наши мысли - это суждения и выводы. Они влияют на наши эмоции. То, как мы думаем влияет на то, что в этот момент мы чувствуем и что мы в результате делаем. Автоматические мысли рождаются из наших убеждений. Наши убеждения когда-то были поддерживающими. Но со временем старые убеждения могут быть уже не эффективными. Попробуй отследить мысли, которые незаметно появляются как бы между основного потока. Они как беззвучное всплывающее сообщение. Тут же исчезают. Но они являются следствием существующей в мозге когнитивной структуры, а так же причиной твоих реакций на мир.", reply_markup=kb_client_misly)


#Раздел работа с ситуацией
# @dp.message_handler(commands=['РАБОТА_С_СИТУАЦИЕЙ'])
async def work_situacy(message : types.Message):
    await message.answer("Любую ситуацию можно разобрать на составляющие фрагменты. Если в этой ситуации есть участники, желательно понимать, у кого какой мотив? Затем задай себе главный вопрос: чего хочешь ты? Что можно для этого сделать? Кто и как может помочь добиться результата или дать поддержку. Избегай обобщений и риторических фраз. Говори меньше. Очень конкретно. Выдерживай паузы. Действуй спокойно! Это даст запас сил на решение проблемы и убережет от импульсивных поступков. Очень полезно излагать свои рассуждения на бумаге, схематично, выделяя основные и второстепенные детали происходящих событий. Очень важно понимать, что от тебя зависит, а что нет. Всегда отвечай за то, что входит только в твою зону ответственности.", reply_markup=kb_client_cituacy)


#Раздел паническая атака
# @dp.message_handler(commands=['ПАНИЧЕСКАЯ_АТАКА'])
async def panick_atack(message : types.Message):
    await message.answer("Мы получаем в кровь большой выброс адреналина. Приступ сильнейшей тревоги/страха/ужаса, который сопровождается учащенным сердцебиением, спутанным сознанием, пульсом, может бить озноб, дрожь, онемение рук или покалывание в конечностях, нехватка воздуха, затруднённое дыхание, боль в груди слева, тошнота, головокружение, предобморочное состояние, страх сойти с ума, совершить что-то неконтролируемое, стах умереть. ПА возникают при крайне высоком уровне тревоги. И при возникновении 'триггера' запускается реакция. Часто нервно-психическая реакция даёт выход тогда, когда на её сдерживание нет ресурса. А ресурса может не быть по разным причинам. Из-за неадаптивности к ситуации. Из-за психического перенапрежения. Из-за ситуации в котрой психика 'не знает' как себя вести и разгоняются вышенаписанные вегетативные и нейроциркуляторные реакции.", reply_markup=kb_client_what_to_do)


# ловим событие что делать
@dp.callback_query_handler(text='whatdo')
async def whatdo_call(callback : types.CallbackQuery):
    await callback.message.answer('1. Запомни! Это не угрожает жизни. Но может привести к падению или удару или ДТП. Постарайся находится в безопасном месте. 2. Это скоро пройдёт! 3. Заранее продумай стратегию как ты будете действовать. Из опыта людей, которые страдают ПА: помогает пить и умываться холодной водой, опускать голову между колен, дышать в пакет, звонить близким, громко включать музыку, петь, прыгать или делать всё что угодно с целью переключить мозг на другие задачи. При оцепенении и дизориентации пробуйте понять: на чем вы сидите, какие предметы находятся вокруг вас. Какой они формы? Цвета? Назовите вслух свои ФИО, где вы учитесь, как зовут ваших близких? Включите игру на смартфоне. Возможно вы найдёте свой способ... Разбираться в причинах возникновения нужно с помощью специалиста, поскольку, при выявлении панического расстройства врач порекомендует противотревожную фармакотерапию.', reply_markup=kb_chto_z_back)
    await callback.answer('Запомни!')

# ловим событие записи
@dp.callback_query_handler(text='zapis')
async def zapis_in(callback : types.CallbackQuery):
    await callback.message.answer('Напишите мне:\nhttps://t.me/psychology_ncfu')
    await callback.answer()


# ловим событие что это такое
@dp.callback_query_handler(text='chto')
async def zapis_in(callback : types.CallbackQuery):
    await callback.message.answer('Мы получаем в кровь большой выброс адреналина. Приступ сильнейшей тревоги/страха/ужаса, который сопровождается учащенным сердцебиением, спутанным сознанием, пульсом, может бить озноб, дрожь, онемение рук или покалывание в конечностях, нехватка воздуха, затруднённое дыхание, боль в груди слева, тошнота, головокружение, предобморочное состояние, страх сойти с ума, совершить что-то неконтролируемое, стах умереть. ПА возникают при крайне высоком уровне тревоги. И при возникновении "триггера" запускается реакция. Часто нервно-психическая реакция даёт выход тогда, когда на её сдерживание нет ресурса. А ресурса может не быть по разным причинам. Из-за неадаптивности к ситуации. Из-за психического перенапрежения. Из-за ситуации в котрой психика "не знает" как себя вести и разгоняются вышенаписанные вегетативные и нейроциркуляторные реакции.', reply_markup=kb_client_what_to_do)
    await callback.answer()



#Раздел стресс
# @dp.message_handler(commands=['СТРЕСС'])
async def stress_fun(message : types.Message):
    await message.answer("Стресс - это естественная реакция психики и тела на внешний раздражитель. Организм мобилизует свои силы чтобы 'выжить'. При стрессе, как и при любом другом значимом сигнале, который мгновенно нами считывается, запускается ряд биохимических процессов. Так в нас работают генетические программы. Мы готовимся к активным действиям. Каким именно, определит чуть позже амигдала, но пока мы не поняли, что конкретно надо делать, тело уже включилось! Это мгновенные реакции. Активируется симпатическая система, которая нам нужна, чтобы повысить чувствительность всех нервных центров и чувств, ускорить реакции. В кровь вбрасывается: остеокальцин, адреналин,  норадреналин, кортизол и их друзья. Кстати, когда кровь нужно направить в мышцы и в голову, для этого организм берет кровь у внутренних органов. У желудка и кишечника в основном. Сердце перекачивает больше крови. Сосуды расширяются, чтобы ею наполнится и обеспечить приток кислорода. Кроме симпатической системы, которая запускает все эти механизмы, у нас есть её компенсаторная подруга - парасимпатическая система. Когда она подключается - мы чувствуем усталость, голод, организм восстанавливает психо-физические процессы и запас сил.", reply_markup=kb_stress)


@dp.message_handler(commands=['Короткий_интенсивный_стресс'])
async def stress_cr_fun(message : types.Message):
    await message.answer("Если стресс кратковременный, но интенсивный - достаточно отреагировать. Часто мы не можем отреагировать, поскольку живём в социуме. Если не получилось это сделать сразу же, но 'желание осталось', то воссоздай ситуацию самостоятельно, когда никто не видит или в присутствии тех людей, которые на твоей стороне и отреагируй, как надо. Это можно сделать у психолога в кабинете. Возможно понадобится сделать это не один раз. Отреагирование позволит завершить естественный процесс 'стимул-реакция'. Выплакать. Покричать. Помолчать. Выразить ненависть. Сожаление. А может быть всё вместе.", reply_markup=kb_kr_stress)


@dp.message_handler(commands=['Длительный_стресс'])
async def stress_dl_fun(message : types.Message):
    await message.answer("Если стресс продолжительный, более недели. 'Включи' аналитика и подумай. Что происходит? Что нужно сделать, чтобы снизить или устранить причину. Возможно нужно взять паузу на пару дней и перезагрузиться. Поменять обстановку, выспаться как следует, побыть на природе. Это очень важно сделать, поскольку есть риск соматически заболеть, что приведёт к ещё большему накоплению задач. Часто человек заболевает или получает травму бессознательно, когда уже нет психических сил быть активным, твоей 'машине' нужен отдых, а ты его ей не даёщь. Если стресс ещё и интенсивный, то подключаются в помошь организму эндокринная, а затем и иммунная системы, по этому длительный стресс изматывает психически, физически, часто запускаются необратимые процессы, которые потом приходится серьёзно лечить у разных врачей. Ищи причину стресса и способы разгрузки психики!", reply_markup=cht_kr_zap)



# регистрация хендлеров
def register_handlers_client(dp: Dispatcher):
    dp.register_message_handler(commands_start, commands=['start', 'help'])
    dp.register_message_handler(otv_ok, lambda message: 'Ok' in message.text)
    dp.register_message_handler(otv_one_three, lambda message: '1-3' in message.text)
    dp.register_message_handler(otv_four_six, lambda message: '4-6' in message.text)
    dp.register_message_handler(otv_seven_ten, Text(equals='7-10', ignore_case=True))
    dp.register_message_handler(dal_further, lambda message: 'Далее' in message.text)
    dp.register_message_handler(link_expert, lambda message: 'Личная консультация' in message.text or 'Запись к психологу' in message.text)
    dp.register_message_handler(self_help, lambda message: 'Самопомощь' in message.text or 'вернуться' in message.text)
    dp.register_message_handler(work_with_emotions, lambda message: 'РАБОТА С ЭМОЦИЯМИ' in message.text or 'Работа с эмоциями' in message.text or 'эмоции' in message.text)
    dp.register_message_handler(strah, lambda message: 'страх' in message.text)
    dp.register_message_handler(grust, lambda message: 'грусть' in message.text)
    dp.register_message_handler(zlo, lambda message: 'злость' in message.text)
    dp.register_message_handler(apat, lambda message: 'апатия' in message.text)
    dp.register_message_handler(work_misly, Text(equals='РАБОТА С МЫСЛЯМИ', ignore_case=True))
    dp.register_message_handler(work_situacy, Text(equals='РАБОТА С СИТУАЦИЕЙ', ignore_case=True))
    dp.register_message_handler(panick_atack, lambda message: 'ПАНИЧЕСКАЯ АТАКА' in message.text)
    dp.register_message_handler(stress_fun, lambda message: 'СТРЕСС' in message.text or 'Что происходит?' in message.text)
    dp.register_message_handler(stress_cr_fun, lambda message: 'Короткий интенсивный стресс' in message.text)
    dp.register_message_handler(stress_dl_fun, lambda message: 'Длительный стресс' in message.text)